Artyom1991/TemperatureSensorNode-cc3200/http_temp_sensor/main.c
	// Remove all profiles
	lRetVal = sl_WlanProfileDel(0xFF);
	ASSERT_ON_ERROR(lRetVal);

	//
	// Device in station-mode. Disconnect previous connection if any
	// The function returns 0 if 'Disconnected done', negative number if already
	// disconnected Wait for 'disconnection' event if 0 is returned, Ignore
	// other return-codes
	//
	lRetVal = sl_WlanDisconnect();
	if (0 == lRetVal) {
		// Wait
		while (IS_CONNECTED(g_ulStatus)) {
#ifndef SL_PLATFORM_MULTI_THREADED
			_SlNonOsMainLoopTask();
#endif
		}
	}

	// Enable DHCP client
	lRetVal = sl_NetCfgSet(SL_IPV4_STA_P2P_CL_DHCP_ENABLE, 1, 1, &ucVal);
	ASSERT_ON_ERROR(lRetVal);

	// Disable scan
	ucConfigOpt = SL_SCAN_POLICY(0);
	lRetVal = sl_WlanPolicySet(SL_POLICY_SCAN, ucConfigOpt, NULL, 0);
	ASSERT_ON_ERROR(lRetVal);

	// Set Tx power level for station mode
	// Number between 0-15, as dB offset from max power - 0 will set max power
	ucPower = 0;
	lRetVal = sl_WlanSet(SL_WLAN_CFG_GENERAL_PARAM_ID,
	WLAN_GENERAL_PARAM_OPT_STA_TX_POWER, 1, (unsigned char *) &ucPower);
	ASSERT_ON_ERROR(lRetVal);

	// Set PM policy to normal
	lRetVal = sl_WlanPolicySet(SL_POLICY_PM, SL_NORMAL_POLICY, NULL, 0);
	ASSERT_ON_ERROR(lRetVal);

	// Unregister mDNS services
	lRetVal = sl_NetAppMDNSUnRegisterService(0, 0);
	ASSERT_ON_ERROR(lRetVal);

	// Remove  all 64 filters (8*8)
	memset(RxFilterIdMask.FilterIdMask, 0xFF, 8);
	lRetVal = sl_WlanRxFilterSet(SL_REMOVE_RX_FILTER, (_u8 *) &RxFilterIdMask,
			sizeof(_WlanRxFilterOperationCommandBuff_t));
	ASSERT_ON_ERROR(lRetVal);

	lRetVal = sl_Stop(SL_STOP_TIMEOUT);
	ASSERT_ON_ERROR(lRetVal);

	InitializeAppVariables();

	return SUCCESS;
}

//****************************************************************************
//
//! \brief Connecting to a WLAN Accesspoint
//!
//!  This function connects to the required AP (SSID_NAME) with Security
//!  parameters specified in te form of macros at the top of this file
//!
//! \param  Status value
//!
//! \return  None
//!
//! \warning    If the WLAN connection fails or we don't aquire an IP
//!            address, It will be stuck in this function forever.
//
//****************************************************************************
static long WlanConnect() {
	SlSecParams_t secParams = { 0 };
	long lRetVal = 0;

	secParams.Key = (signed char *) SECURITY_KEY;
	secParams.KeyLen = strlen(SECURITY_KEY);
	secParams.Type = SECURITY_TYPE;

	lRetVal = sl_WlanConnect((signed char *) SSID_NAME,
			strlen((const char *) SSID_NAME), 0, &secParams, 0);
	ASSERT_ON_ERROR(lRetVal);

	// Wait for WLAN Event
	while ((!IS_CONNECTED(g_ulStatus)) || (!IS_IP_ACQUIRED(g_ulStatus))) {
		// wait till connects to an AP
		_SlNonOsMainLoopTask();
	}

	return SUCCESS;

}

//*****************************************************************************
//
//! \brief Flush response body.
//!
//! \param[in]  httpClient - Pointer to HTTP Client instance
//!
//! \return 0 on success else error code on failure
//!
//*****************************************************************************
static int FlushHTTPResponse(HTTPCli_Handle httpClient) {
	const char *ids[2] = {
	HTTPCli_FIELD_NAME_CONNECTION, /* App will get connection header value. all others will skip by lib */
	NULL };
	char buf[128];
	int id;
	int len = 1;
	bool moreFlag = 0;
	char ** prevRespFilelds = NULL;

	/* Store previosly store array if any */
	prevRespFilelds = HTTPCli_setResponseFields(httpClient, ids);

	/* Read response headers */
	while ((id = HTTPCli_getResponseField(httpClient, buf, sizeof(buf),
			&moreFlag)) != HTTPCli_FIELD_ID_END) {

		if (id == 0) {
			if (!strncmp(buf, "close", sizeof("close"))) {
				UART_PRINT("Connection terminated by server\n\r");
			}
		}

	}

	/* Restore previosuly store array if any */
	HTTPCli_setResponseFields(httpClient, (const char **) prevRespFilelds);

	while (1) {
		/* Read response data/body */
		/* Note:
		 moreFlag will be set to 1 by HTTPCli_readResponseBody() call, if more
		 data is available Or in other words content length > length of buffer.
		 The remaining data will be read in subsequent call to HTTPCli_readResponseBody().
		 Please refer HTTP Client Libary API documenation @ref HTTPCli_readResponseBody
		 for more information.
		 */
		HTTPCli_readResponseBody(httpClient, buf, sizeof(buf) - 1, &moreFlag);
		ASSERT_ON_ERROR(len);

		if ((len - 2) >= 0 && buf[len - 2] == '\r' && buf[len - 1] == '\n') {
			break;
		}

		if (!moreFlag) {
			/* There no more data. break the loop. */
			break;
		}
	}
	return 0;
}

//*****************************************************************************
//
//! \brief Handler for parsing JSON data
//!
//! \param[in]  ptr - Pointer to http response body data
//!
//! \return 0 on success else error code on failure
//!
//*****************************************************************************
int ParseJSONData(char *ptr) {
	long lRetVal = 0;
	int noOfToken;
	jsmn_parser parser;
	jsmntok_t *tokenList;

	/* Initialize JSON PArser */
	jsmn_init(&parser);

	/* Get number of JSON token in stream as we we dont know how many tokens need to pass */
	noOfToken = jsmn_parse(&parser, (const char *) ptr,
			strlen((const char *) ptr), NULL, 10);
	if (noOfToken <= 0) {
		UART_PRINT("Failed to initialize JSON parser\n\r");
		return -1;

	}

	/* Allocate memory to store token */
	tokenList = (jsmntok_t *) malloc(noOfToken * sizeof(jsmntok_t));
	if (tokenList == NULL) {
		UART_PRINT("Failed to allocate memory\n\r");
		return -1;
	}

	/* Initialize JSON Parser again */
	jsmn_init(&parser);
	noOfToken = jsmn_parse(&parser, (const char *) ptr,
			strlen((const char *) ptr), tokenList, noOfToken);
	if (noOfToken < 0) {
		UART_PRINT("Failed to parse JSON tokens\n\r");
		lRetVal = noOfToken;
	} else {
		UART_PRINT("Successfully parsed %ld JSON tokens\n\r", noOfToken);
	}

