Artyom1991/TemperatureSensorNode-cc3200/http_temp_sensor/main.c
	free(tokenList);

	return lRetVal;
}

/*!
 \brief This function read respose from server and dump on console

 \param[in]      httpClient - HTTP Client object

 \return         0 on success else -ve

 \note

 \warning
 */
static int readResponse(HTTPCli_Handle httpClient) {
	long lRetVal = 0;
	int bytesRead = 0;
	int id = 0;
	unsigned long len = 0;
	int json = 0;
	char *dataBuffer = NULL;
	bool moreFlags = 1;
	const char *ids[4] = {
	HTTPCli_FIELD_NAME_CONTENT_LENGTH,
	HTTPCli_FIELD_NAME_CONNECTION,
	HTTPCli_FIELD_NAME_CONTENT_TYPE,
	NULL };

	/* Read HTTP POST request status code */
	lRetVal = HTTPCli_getResponseStatus(httpClient);
	if (lRetVal > 0) {
		switch (lRetVal) {
		case 200: {
			UART_PRINT("HTTP Status 200\n\r");
			/*
			 Set response header fields to filter response headers. All
			 other than set by this call we be skipped by library.
			 */
			HTTPCli_setResponseFields(httpClient, (const char **) ids);

			/* Read filter response header and take appropriate action. */
			/* Note:
			 1. id will be same as index of fileds in filter array setted
			 in previous HTTPCli_setResponseFields() call.

			 2. moreFlags will be set to 1 by HTTPCli_getResponseField(), if  field
			 value could not be completely read. A subsequent call to
			 HTTPCli_getResponseField() will read remaining field value and will
			 return HTTPCli_FIELD_ID_DUMMY. Please refer HTTP Client Libary API
			 documenation @ref HTTPCli_getResponseField for more information.
			 */
			while ((id = HTTPCli_getResponseField(httpClient, (char *) g_buff,
					sizeof(g_buff), &moreFlags)) != HTTPCli_FIELD_ID_END) {

				switch (id) {
				case 0: /* HTTPCli_FIELD_NAME_CONTENT_LENGTH */
				{
					len = strtoul((char *) g_buff, NULL, 0);
				}
					break;
				case 1: /* HTTPCli_FIELD_NAME_CONNECTION */
				{
				}
					break;
				case 2: /* HTTPCli_FIELD_NAME_CONTENT_TYPE */
				{
					if (!strncmp((const char *) g_buff, "application/json",
							sizeof("application/json"))) {
						json = 1;
					} else {
						/* Note:
						 Developers are advised to use appropriate
						 content handler. In this example all content
						 type other than json are treated as plain text.
						 */
						json = 0;
					}
					UART_PRINT(HTTPCli_FIELD_NAME_CONTENT_TYPE);
					UART_PRINT(" : ");
					UART_PRINT("application/json\n\r");
				}
					break;
				default: {
					UART_PRINT("Wrong filter id\n\r");
					lRetVal = -1;
					goto end;
				}
				}
			}
			bytesRead = 0;
			if (len > sizeof(g_buff)) {
				dataBuffer = (char *) malloc(len);
				if (dataBuffer) {
					UART_PRINT("Failed to allocate memory\n\r");
					lRetVal = -1;
					goto end;
				}
			} else {
				dataBuffer = (char *) g_buff;
			}

			/* Read response data/body */
			/* Note:
			 moreFlag will be set to 1 by HTTPCli_readResponseBody() call, if more
			 data is available Or in other words content length > length of buffer.
			 The remaining data will be read in subsequent call to HTTPCli_readResponseBody().
			 Please refer HTTP Client Libary API documenation @ref HTTPCli_readResponseBody
			 for more information

			 */
			bytesRead = HTTPCli_readResponseBody(httpClient,
					(char *) dataBuffer, len, &moreFlags);
			if (bytesRead < 0) {
				UART_PRINT("Failed to received response body\n\r");
				lRetVal = bytesRead;
				goto end;
			} else if (bytesRead < len || moreFlags) {
				UART_PRINT(
						"Mismatch in content length and received data length\n\r");
				goto end;
			}
			dataBuffer[bytesRead] = '\0';

			if (json) {
				/* Parse JSON data */
				lRetVal = ParseJSONData(dataBuffer);
				if (lRetVal < 0) {
					goto end;
				}
			} else {
				/* treating data as a plain text */
			}

		}
			break;

		case 404:
			UART_PRINT("File not found. \r\n");
			/* Handle response body as per requirement.
			 Note:
			 Developers are advised to take appopriate action for HTTP
			 return status code else flush the response body.
			 In this example we are flushing response body in default
			 case for all other than 200 HTTP Status code.
			 */
		default:
			/* Note:
			 Need to flush received buffer explicitly as library will not do
			 for next request.Apllication is responsible for reading all the
			 data.
			 */
			FlushHTTPResponse(httpClient);
			break;
		}
	} else {
		UART_PRINT("Failed to receive data from server.\r\n");
		goto end;
	}

	lRetVal = 0;

	end: if (len > sizeof(g_buff) && (dataBuffer != NULL)) {
		free(dataBuffer);
	}
	return lRetVal;
}

//*****************************************************************************
//
//! \brief HTTP POST Demonstration
//!
//! \param[in]  httpClient - Pointer to http client
//!
//! \return 0 on success else error code on failure
//!
//*****************************************************************************
static int HTTPPostMethod(HTTPCli_Handle httpClient) {
	bool moreFlags = 1;
	bool lastFlag = 1;
	char tmpBuf[4];
	long lRetVal = 0;
	HTTPCli_Field fields[4] = { { HTTPCli_FIELD_NAME_HOST, HOST_NAME }, {
	HTTPCli_FIELD_NAME_ACCEPT, "*/*" }, {
	HTTPCli_FIELD_NAME_CONTENT_TYPE, "application/json" }, { NULL, NULL } };

	/* Set request header fields to be send for HTTP request. */
	HTTPCli_setRequestFields(httpClient, fields);

	/* Send POST method request. */
	/* Here we are setting moreFlags = 1 as there are some more header fields need to send
	 other than setted in previous call HTTPCli_setRequestFields() at later stage.
	 Please refer HTTP Library API documentaion @ref HTTPCli_sendRequest for more information.
	 */
	moreFlags = 1;
	lRetVal = HTTPCli_sendRequest(httpClient, HTTPCli_METHOD_POST,
	POST_REQUEST_URI, moreFlags);
	if (lRetVal < 0) {
		UART_PRINT("Failed to send HTTP POST request header.\n\r");
		return lRetVal;
	}

	sprintf((char *) tmpBuf, "%d", (sizeof(POST_DATA) - 1));

	/* Here we are setting lastFlag = 1 as it is last header field.
	 Please refer HTTP Library API documentaion @ref HTTPCli_sendField for more information.
	 */
	lastFlag = 1;
	lRetVal = HTTPCli_sendField(httpClient, HTTPCli_FIELD_NAME_CONTENT_LENGTH,
			(const char *) tmpBuf, lastFlag);
	if (lRetVal < 0) {
		UART_PRINT("Failed to send HTTP POST request header.\n\r");
		return lRetVal;
	}

	/* Send POST data/body */
	lRetVal = HTTPCli_sendRequestBody(httpClient, POST_DATA,
			(sizeof(POST_DATA) - 1));
	if (lRetVal < 0) {
		UART_PRINT("Failed to send HTTP POST request body.\n\r");
		return lRetVal;
	}

	lRetVal = readResponse(httpClient);

