Artyom1991/TemperatureSensorNode-cc3200/http_temp_sensor/main.c
	return lRetVal;
}

//*****************************************************************************
//
//! Function to connect to AP
//!
//! \param  none
//!
//! \return Error-code or SUCCESS
//!
//*****************************************************************************
static long ConnectToAP() {
	long lRetVal = -1;

	//
	// Following function configure the device to default state by cleaning
	// the persistent settings stored in NVMEM (viz. connection profiles &
	// policies, power policy etc)
	//
	// Applications may choose to skip this step if the developer is sure
	// that the device is in its desired state at start of applicaton
	//
	// Note that all profiles and persistent settings that were done on the
	// device will be lost
	//
	lRetVal = ConfigureSimpleLinkToDefaultState();
	if (lRetVal < 0) {
		if (DEVICE_NOT_IN_STATION_MODE == lRetVal) {
			UART_PRINT("Failed to configure the device in its default state, "
					"Error-code: %d\n\r", DEVICE_NOT_IN_STATION_MODE);
		}

		return -1;
	}

	UART_PRINT("Device is configured in default state \n\r");

	//
	// Assumption is that the device is configured in station mode already
	// and it is in its default state
	//
	lRetVal = sl_Start(0, 0, 0);
	if (lRetVal < 0 || ROLE_STA != lRetVal) {
		ASSERT_ON_ERROR(DEVICE_START_FAILED);
	}

	UART_PRINT("Device started as STATION \n\r");

	// Connecting to WLAN AP - Set with static parameters defined at the top
	// After this call we will be connected and have IP address
	lRetVal = WlanConnect();

	UART_PRINT("Connected to the AP: %s\r\n", SSID_NAME);
	return 0;
}

//*****************************************************************************
//
//! Function to connect to HTTP server
//!
//! \param  httpClient - Pointer to HTTP Client instance
//!
//! \return Error-code or SUCCESS
//!
//*****************************************************************************
static int ConnectToHTTPServer(HTTPCli_Handle httpClient) {
	long lRetVal = -1;
	struct sockaddr_in addr;

	/* Resolve HOST NAME/IP */
	lRetVal = sl_NetAppDnsGetHostByName((signed char *) HOST_NAME,
			strlen((const char *) HOST_NAME), &g_ulDestinationIP, SL_AF_INET);
	if (lRetVal < 0) {
		ASSERT_ON_ERROR(GET_HOST_IP_FAILED);
	}

	/* Set up the input parameters for HTTP Connection */
	addr.sin_family = AF_INET;
	addr.sin_port = htons(HOST_PORT);
	addr.sin_addr.s_addr = sl_Htonl(g_ulDestinationIP);

	/* Testing HTTPCli open call: handle, address params only */
	HTTPCli_construct(httpClient);
	lRetVal = HTTPCli_connect(httpClient, (struct sockaddr *) &addr, 0, NULL);
	if (lRetVal < 0) {
		UART_PRINT("Connection to server failed. error(%d)\n\r", lRetVal);
		ASSERT_ON_ERROR(SERVER_CONNECTION_FAILED);
	} else {
		UART_PRINT("Connection to server created successfully\r\n");
	}

	return 0;
}

//*****************************************************************************
//
//! Application startup display on UART
//!
//! \param  none
//!
//! \return none
//!
//*****************************************************************************
static void DisplayBanner(char * AppName) {
	UART_PRINT("\n\n\n\r");
	UART_PRINT("\t\t *************************************************\n\r");
	UART_PRINT("\t\t      CC3200 %s Application       \n\r", AppName);
	UART_PRINT("\t\t *************************************************\n\r");
	UART_PRINT("\n\n\n\r");
}

//*****************************************************************************
//
//! The interrupt handler for the first timer interrupt.
//!
//! \param  None
//!
//! \return none
//
//*****************************************************************************
void TimerBaseIntHandler(void) {
	//
	// Clear the timer interrupt.
	//
	Timer_IF_InterruptClear(g_ulBase);

	g_HTTP_SEND_FLAG = 1;
}

//*****************************************************************************
//
//! Timer0 and green LED initialization
//!
//! \param  None
//!
//! \return none
//
//*****************************************************************************

void configureTimerA0(void) {
	//
	// configure the LED RED and GREEN
	//
	GPIO_IF_LedConfigure(LED3);
	GPIO_IF_LedOff(MCU_GREEN_LED_GPIO);
	asm("nop");

	//
	// Base address for timer
	//
	g_ulBase = TIMERA0_BASE;

	//
	// Configuring the timers
	//
	Timer_IF_Init(PRCM_TIMERA0, g_ulBase, TIMER_CFG_PERIODIC, TIMER_A, 0);

	//
	// Setup the interrupts for the timer timeouts.
	//
	Timer_IF_IntSetup(g_ulBase, TIMER_A, TimerBaseIntHandler);

	//
	// Turn on the timers feeding values in mSec
	//
	Timer_IF_Start(g_ulBase, TIMER_A, POST_HTTP_INTERVAL_MS);
}

//*****************************************************************************
//
//! Board Initialization & Configuration
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
static void BoardInit(void) {
	/* In case of TI-RTOS vector table is initialize by OS itself */
#ifndef USE_TIRTOS
	//
	// Set vector table base
	//
#if defined(ccs) || defined(gcc)
	MAP_IntVTableBaseSet((unsigned long) &g_pfnVectors[0]);
#endif
#endif
	//
	// Enable Processor
	//
	MAP_IntMasterEnable();
	MAP_IntEnable(FAULT_SYSTICK);

	PRCMCC3200MCUInit();
}

int main() {
	long lRetVal = -1;
	//http client
	HTTPCli_Struct httpClient;

	//
	// Board Initialization
	//
	BoardInit();

	//
	// Configure the pinmux settings for the peripherals exercised
	//
	PinMuxConfig();

	//
	// Configuring UART
	//
	InitTerm();

	//
	// Display banner
	//
	DisplayBanner(APP_NAME);

	InitializeAppVariables();

	//
	//init timerA0 and green led
	//perform sending http data by timer interrupt
	//
	configureTimerA0();

	long postPerformRes = -1;
	//g_ulTimerInts++;

	// Stop the CC3200 device
	g_HTTP_SEND_FLAG = 1;
	while (1) {
		if (g_HTTP_SEND_FLAG) {
			//turn on LED
			GPIO_IF_LedOn(MCU_GREEN_LED_GPIO);

			g_HTTP_SEND_FLAG = 0;

			postPerformRes = ConnectToAP();
			if (postPerformRes < 0) {
				LOOP_FOREVER()
				;
			}

			//connect to server
			postPerformRes = ConnectToHTTPServer(&httpClient);
			if (postPerformRes < 0) {
				LOOP_FOREVER()
				;
			}

			//perform HTTP POST request
			UART_PRINT("\n\r");
			UART_PRINT("HTTP Post Begin:\n\r");
			postPerformRes = HTTPPostMethod(&httpClient);
			if (postPerformRes < 0) {
				UART_PRINT("HTTP Post failed, result:%l.\n\r", postPerformRes);
			}
			UART_PRINT("HTTP Post End:\n\r");
			//turn off led
			GPIO_IF_LedOff(MCU_GREEN_LED_GPIO);
		}
	}
}

